{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_31", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 350, 350, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_93_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_93", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "ReLU", "config": {"name": "re_lu_140", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_62", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_94", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "ReLU", "config": {"name": "re_lu_141", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_63", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_95", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "ReLU", "config": {"name": "re_lu_142", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_31", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_31", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ReLU", "config": {"name": "re_lu_143", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_62", "trainable": true, "dtype": "float32", "rate": 0.8, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "dtype": "float32", "units": 124, "activation": {"class_name": "ReLU", "config": {"name": "re_lu_144", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_63", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": 2.56e-05, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.00011200000153621659, "beta_1": 0.755, "beta_2": 0.992, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of29.bin", "group1-shard2of29.bin", "group1-shard3of29.bin", "group1-shard4of29.bin", "group1-shard5of29.bin", "group1-shard6of29.bin", "group1-shard7of29.bin", "group1-shard8of29.bin", "group1-shard9of29.bin", "group1-shard10of29.bin", "group1-shard11of29.bin", "group1-shard12of29.bin", "group1-shard13of29.bin", "group1-shard14of29.bin", "group1-shard15of29.bin", "group1-shard16of29.bin", "group1-shard17of29.bin", "group1-shard18of29.bin", "group1-shard19of29.bin", "group1-shard20of29.bin", "group1-shard21of29.bin", "group1-shard22of29.bin", "group1-shard23of29.bin", "group1-shard24of29.bin", "group1-shard25of29.bin", "group1-shard26of29.bin", "group1-shard27of29.bin", "group1-shard28of29.bin", "group1-shard29of29.bin"], "weights": [{"name": "batch_normalization_57/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_58/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_58/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_58/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_58/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_59/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_59/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_59/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_59/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [4, 4, 3, 8], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [4, 4, 8, 16], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_95/kernel", "shape": [4, 4, 16, 32], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_93/kernel", "shape": [59168, 512], "dtype": "float32"}, {"name": "dense_93/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_94/kernel", "shape": [512, 124], "dtype": "float32"}, {"name": "dense_94/bias", "shape": [124], "dtype": "float32"}, {"name": "dense_95/kernel", "shape": [124, 1], "dtype": "float32"}, {"name": "dense_95/bias", "shape": [1], "dtype": "float32"}]}]}